OpenNuvoton/NUC121_125BSP/SampleCode/StdDriver/USBD_HID_Transfer_and_MSC/HID_Transfer_and_MSC.c
                        /* Bulk IN buffer */
                        USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + g_u32BulkBuf1), (uint8_t *)g_u32Address, g_u8Size);

                        g_u32Address += g_u8Size;

                        USBD_SET_EP_BUF_ADDR(EP4, g_u32BulkBuf0);
                        MSC_Read();
                    }

                    return;
                }

                case UFI_INQUIRY:
                {
                    uint32_t u32Len;
                    uint8_t u8PageCode;


                    u32Len = g_sCBW.dCBWDataTransferLength;

                    /* Limit length */
                    if (u32Len > 36) u32Len = 36;

                    u8PageCode = g_sCBW.au8Data[0];


                    g_u8BulkState = BULK_IN;

                    if (u32Len)
                    {
                        /* u8PageCode should be zero */
                        if (u8PageCode)
                        {
                            /* Expecting a STALL after data phase completes with a zero-length or short packet */
                            //USBD_SET_EP_STALL(EP0);
                            USBD_SET_EP_STALL(EP5);
                            USBD_LockEpStall(1 << EP5);

                            DBG_PRINTF("INQUIRY page code = %d", u8PageCode);
                        }

                        /* Bulk IN buffer */
                        USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + g_u32BulkBuf1), (uint8_t *)g_au8InquiryID, u32Len);
                        USBD_SET_PAYLOAD_LEN(EP4, u32Len);

                        DBG_PRINTF("Inquiry, len %d\n", u32Len);


                    }
                    else
                    {
                        /* Next is status phase if zero data length in data phase */
                        MSC_AckCmd();
                    }

                    return;
                }

                case UFI_READ_10:
                case UFI_READ_12:
                {
                    /* Check if it is a new transfer */
                    if (g_u32Length == 0)
                    {
                        /* Prepare the data for Bulk IN transfer */

                        /* Get LBA address */
                        g_u32Address = get_be32(&g_sCBW.au8Data[0]);
                        g_u32LbaAddress = g_u32Address * UDC_SECTOR_SIZE;
                        g_u32Length = g_sCBW.dCBWDataTransferLength;
                        g_u32BytesInStorageBuf = g_u32Length;

                        DBG_PRINTF("Read addr=0x%x, len=0x%x\n", g_u32LbaAddress, g_u32Length);

                        /* Error check  */
                        if ((g_u32LbaAddress > DATA_FLASH_STORAGE_SIZE) || (g_u32LbaAddress + g_u32Length > DATA_FLASH_STORAGE_SIZE))
                        {

                            USBD_SET_EP_STALL(EP4);
                            USBD_SET_EP_STALL(EP5);
                            USBD_LockEpStall((1 << EP4) | (1 << EP5));

                            DBG_PRINTF("Stall ep2, ep3. addr=0x%x, len=0x%x\n", g_u32LbaAddress, g_u32Length);

                            return;
                        }


                        i = g_u32Length;

                        if (i > STORAGE_BUFFER_SIZE)
                            i = STORAGE_BUFFER_SIZE;

                        MSC_ReadMedia(g_u32Address * UDC_SECTOR_SIZE, i, (uint8_t *)STORAGE_DATA_BUF);
                        g_u32BytesInStorageBuf = i;
                        g_u32LbaAddress += i;
                    }

                    g_u32Address = STORAGE_DATA_BUF;

                    /* Indicate the next packet should be Bulk IN Data packet */
                    g_u8BulkState = BULK_IN;

                    if (g_u32BytesInStorageBuf > 0)
                    {
                        /* Set the packet size */
                        if (g_u32BytesInStorageBuf > EP4_MAX_PKT_SIZE)
                            g_u8Size = EP4_MAX_PKT_SIZE;
                        else
                            g_u8Size = g_u32BytesInStorageBuf;

                        /* Prepare the first data packet (DATA1) */
                        /* Bulk IN buffer */
                        USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + g_u32BulkBuf1), (uint8_t *)g_u32Address, g_u8Size);
                        g_u32Address += g_u8Size;

                        /* kick - start */
                        USBD_SET_EP_BUF_ADDR(EP4, g_u32BulkBuf1);
                        /* Trigger to send out the data packet */
                        USBD_SET_PAYLOAD_LEN(EP4, g_u8Size);
                        g_u32Length -= g_u8Size;
                        g_u32BytesInStorageBuf -= g_u8Size;
                    }

                    return;
                }

                case UFI_WRITE_10:
                case UFI_WRITE_12:
                {


                    if (g_u32Length == 0)
                    {
                        g_u32Length = g_sCBW.dCBWDataTransferLength;
                        g_u32Address = STORAGE_DATA_BUF;
                        g_u32DataFlashStartAddr = get_be32(&g_sCBW.au8Data[0]) * UDC_SECTOR_SIZE;
                    }

                    DBG_PRINTF("Write 0x%x  0x%x\n", g_u32Address, g_u32Length);

                    if ((g_u32Length > 0))
                    {
                        USBD_SET_PAYLOAD_LEN(EP5, EP5_MAX_PKT_SIZE);
                        g_u8BulkState = BULK_OUT;
                    }

                    return;
                }

                case UFI_MODE_SENSE_6:
                {
                    uint32_t u32Data = 0x3;
                    g_u8BulkState = BULK_IN;
                    USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + g_u32BulkBuf1), (uint8_t *)u32Data, 4);
                    USBD_SET_PAYLOAD_LEN(EP4, 4);
                    return;
                }

                case UFI_MODE_SELECT_6:
                {
                    g_u32Length = g_sCBW.dCBWDataTransferLength;
                    g_u32Address = MassCMD_BUF;

                    if (g_u32Length > 0)
                    {
                        USBD_SET_PAYLOAD_LEN(EP5, EP5_MAX_PKT_SIZE);
                        g_u8BulkState = BULK_OUT;
                    }

                    return;
                }

                default:
                {
                    /* Just stall for unknown command */
                    //USBD_SET_EP_STALL(EP2);
                    //USBD_SET_EP_STALL(EP3);
                    //USBD_LockEpStall((1 << EP2) | (1 << EP3));
                    /* Unknow command */

                    DBG_PRINTF("Unknow cmd 0x%x\n", g_sCBW.u8OPCode);

                    if (g_sCBW.bmCBWFlags & 0x80)
                        USBD_SET_PAYLOAD_LEN(EP4, 4);

